export default {
  bar: [
    {
      id: 0,
      name: '基础线型图',
      type: 'bar',
      active: false,
      code: '',
      data: {
        xAxis: ['18岁以下', '18-24岁', '25-34岁', '35-44岁', '45岁'],
        yAxis: [3, 25, 43, 18, 11]
      }
    }, {
      id: 1,
      name: '堆叠柱状图',
      type: 'bar',
      active: false,
      code: '',
      data: {
        xAxis: ['18岁以下', '18-24岁', '25-34岁', '35-44岁', '45岁'],
        yAxis: [
          [3, 25, 33, 18, 11],
          [3, 25, 13, 18, 11]
        ]
      }
    }, {
      id: 2,
      name: '多维分组柱形图',
      type: 'bar',
      active: false,
      code: '',
      data: {
        xAxis: ['10:00', '12:00', '14:00', '16:00', '18:00', '20:00', '22:00'],
        yAxis: [
          [30, 40, 54, 65, 34, 54, 67],
          [34, 54, 65, 76, 78, 98, 54]
        ]
      }
    }, {
      id: 3,
      name: '双轴折现柱状图',
      type: 'bar',
      active: false,
      code: '',
      data: {
        xAxis: ['05-28', '06-03', '06-09', '06-15', '06-21', '06-27'], // x 轴数值，日期
        yAxis: {
          barData: [200, 123, 324, 122, 325, 456], //  充电桩使用次数
          lineData: [300, 323, 214, 154, 366, 453] // 充电桩使用能耗
        }
      }
    }, {
      id: 4,
      name: '基础条形图',
      type: 'bar',
      active: false,
      code: '',
      data: {
        xAxis: ['社保', '缴纳罚款', '违法处理', '户政', '出入境'],
        yAxis: [617, 593, 327, 294, 236]
      }
    }
  ]
}
